//
//  main.cpp
//  Shift_Reduce
//
//  Created by 양준식 on 2020/06/05.
//  Copyright © 2020 양준식. All rights reserved.
//

#include <iostream>
using namespace std;
#include <string>
#include<vector>
#include "dfatable.hpp"
#include "DFAstateInfo.h"
#include "terminalitem.h"
//vtype    num    float    literal    id    if    else    while    for    return    addsub    multdiv    assign    comp    semi    comma    lparen    rparen    lbrace    rbrace
//이 terminal symbol들이 차례로 0번 부터 19번까지의 symbol들이라고 생각하고 프로그램을 작성함.

int main(){
 //이 프로그램은 S3과 같이 shift& goto를 나타내는 칸들을 채워주는 프로그램이므로, $ column에는 해당사항이 없다. 따라서 column수가 20인 것.
    string SLR_action[85][20]={
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"},
        {"n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n","n"}
    
    };
    
    
 
    
    for(int i=0;i<85;i++){ //i가 출발하는 dfa state 번호
        
      for(int j=0;j<20;j++){//j가 transition에 필요한 terminal 심볼
          
          if(DFA_terminal_tran_only[i][j]!=85){// 배열[i][j]가  i,j로 인해 가는 dfa state
              //여기까지가 qi에서 j번 terminal로 인해 DFA_terminal_tran_only[i][j]번 dfa state로  트랜지션이  존재한다는 것이므로, 해당 qi stateinfo에서 해당 terminal에 대한 번호가 있는지 확인해주고, 1. 있다면, slr table의 i,j에 S DFA_t_t_o[i][j] (e.g. S7  or S3)라고 추가.
                  //2.없다면, pass
         
                  for(int l=0;l<DFAstateInfo[i].size();l++){
                      
                      for(int k=0;k<terminalItem[j].size();k++){
                      
                      if(DFAstateInfo[i][l]==terminalItem[j][k]){
                         SLR_action[i][j]="s"+to_string(DFA_terminal_tran_only[i][j]);
                        
                        
                      }
                      
                      }
                  }
              
          }
        
          else{}
       }
           
  }
    
   for(int m=0;m<85;m++){
        //cout<<"{ ";
        for(int n=0;n<20;n++){
            cout<<SLR_action[m][n];
            if(n!=19){
                cout<<" , ";
            }
        }cout<<endl;
    }
    
    

   

}
